Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_DA_DFP/1.0.64/atdf/PIC32MZ1025DAH169.atdf
      <value-group caption="DMA Channel 7 Interrupt bit" name="USBDMAINT__DMA7IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Channel 8 Interrupt bit" name="USBDMAINT__DMA8IF">
         <value caption="The DMA channel has an interrupt event" name="" value="0x1" />
         <value caption="No interrupt event" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA1C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA1C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA1C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA1C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA1C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA1C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA2C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA2C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA2C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA2C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA2C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA2C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA3C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA3C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA3C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Interrupt Enable bit" name="USBDMA3C__DMAIE">
         <value caption="Interrupt is enabled for this channel" name="" value="0x1" />
         <value caption="Interrupt is disabled for this channel" name="" value="0x0" />
      </value-group>
      <value-group caption="Bus Error bit" name="USBDMA3C__DMAERR">
         <value caption="A bus error has been observed on the input" name="" value="0x1" />
         <value caption="The software writes this to clear the error" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Burst Mode Selection bit" name="USBDMA3C__DMABRSTM">
         <value caption="Burst Mode 3: INCR16" name="" value="0x3" />
         <value caption="Burst Mode 2: INCR8" name="" value="0x2" />
         <value caption="Burst Mode 1: INCR4 or unspecified length" name="" value="0x1" />
         <value caption="Burst Mode 0: Bursts of unspecified length" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="USBDMA4C__DMAEN">
         <value caption="Enable the DMA transfer and start the transfer" name="" value="0x1" />
         <value caption="Disable the DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Direction bit" name="USBDMA4C__DMADIR">
         <value caption="DMA Read (TX endpoint)" name="" value="0x1" />
         <value caption="DMA Write (RX endpoint)" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Transfer Mode bit" name="USBDMA4C__DMAMODE">
         <value caption="DMA Mode1 Transfers" name="" value="0x1" />
         <value caption="DMA Mode0 Transfers" name="" value="0x0" />
      </value-group>
